"use strict";

// let param = 16;
// console.log(param);

// console.log('Текст из script.js!');
// document.getElementById

// Задание 2:
// 1. Создайте переменную `num` и присвойте ей значение `123`. Выведите значение этой переменной в консоль.
// const num = 123;
// console.log(num);

// 2. Создайте переменную `а` и присвойте ей значение `5`, переопределите переменную `а` на значение `7`, выведите переменную `а` в консоль.
// let a = 5;
// a = 7;
// console.log(a);

// 3. Создайте переменную `b`. Запишите в нее сумму чисел `1`, `2` и `3`. С помощью функции `console.log` выведите в консоль содержимое переменной `b`.
// const b = 1 + 2 + 3;
// console.log(b);
/* 4. Создайте два вида комментариев в вашем коде, добавьте в них произвольный текст.*/

// Задание 3:
// 1. Создайте две переменные, одна будет хранить ваш возраст (девушкам всегда 18), а другая переменная будет хранить текущий год (все созданные переменные должны быть логично названы).
// const age = 56;
// const currentYear = 2023;
// - Создайте переменную суммы и присвойте сумму чисел из двух переменных.
// const sumTemp = age + currentYear;
// - Создайте переменную разности и присвойте разность текущего года и вашего возраста.
// const diffTemp = currentYear - age;
// - Создайте переменную произведения и присвойте произведение чисел двух переменных.
// const mulTemp = age * currentYear;
// - Создайте переменную частного и присвойте деление чисел текущего года к вашему возрасту.
// const divTemp = currentYear / age;
// 2. Выведите в консоль все созданные переменные.
// console.log(sumTemp, ' ', diffTemp, ' ', mulTemp, ' ', divTemp);
// 3. Сложите все созданные переменные и выведите результат в консоль.
// console.log(sumTemp + diffTemp + mulTemp + divTemp);

// Задание 4:
// Не запуская код, определите, что отобразится в консоли:
// `let a = 5 + 5 * 3 + 3;`
// Не запуская код, определите, что отобразится в консоли:
// `let b = 8 / 2 + 2;`
// Не запуская код, определите, что отобразится в консоли:
// `let c = (2 + 3) * (2 + 3);`
// Не запуская код, определите, что отобразится в консоли:
// `let d = (2 + 3) * 2 + 3;`
// Не запуская код, определите, что отобразится в консоли:
// `let e = (2 * 8) / 4;`
// Не запуская код, определите, что отобразится в консоли:
// console.log(3 * (9 / 27), ' ', 3 * 9 / 27);

// адание 5:
// 1. Запишите в переменную `a` число `0.1`, а в переменную `b` - число `0.2`. Найдите сумму значений этих переменных и выведите ее на экран.
// const a = 0.1;
// const b = 0.2;
// console.log(a + b);
// const PI = 3.141592653589;
// console.log(PI);
// console.log(PI.toFixed(5));
// console.log(' ');
// console.log(Math.round(PI * 1000) / 1000);
// console.log(Math.floor(PI * 1000) / 1000);
// console.log(Math.ceil(PI * 1000) / 1000);
// console.log(Math.trunc(PI * 1000) / 1000);
// console.log(' ');
// console.log(Math.round(-PI * 1000) / 1000);
// console.log(Math.floor(-PI * 1000) / 1000);
// console.log(Math.ceil(-PI * 1000) / 1000);
// console.log(Math.trunc(-PI * 1000) / 1000);
// 2. Создайте переменную `c`, запишите в нее какое-нибудь положительное или отрицательное число. Выведите на экран это число с обратным знаком.
// Задание 6:
// 1. Создайте строку с вашем именем и строку с вашей фамилией. Выведите эти данные в консоль.
// const nameTemp = 'Ilya';
// const familyName = 'Tsigelnitskii';
// console.log(nameTemp + ' ' + familyName);
// 2. Создайте переменную с текстом 'java' и переменную с текстом 'script'. С помощью этих переменных и операции конкатенации строк выведите в консоль строку 'javascript'.
// const temp1 = 'java';
// const temp2 = 'script';
// console.log(temp1 + temp2);
// 3. Создайте переменную с текстом 'hello' и переменную с текстом 'world'. С помощью этих переменных и операции конкатенации строк выведите в консоль строку 'hello world', желательно использовать бэктики (обратные кавычки).
// const temp3 = 'hello';
// const temp4 = 'world';
// console.log(`${temp3} ${temp4} \n\n text`);

// const a = '113.026b456';
// console.log(Number.parseInt(a));
// console.log(Number.parseFloat(a));
// console.log(+a);
// console.log(Number(a));

// const b = 'True';

const a = String("ggg");
console.log(a);
